patchew-project/qemu/hw/mips/pic32mk.c
/*
 * Microchip PIC32MK GPK/MCM with CAN FD — board emulation
 * Datasheet: DS60001519E
 *
 * Phase 2: CPU core, EVIC, UART×6, Timers×9, GPIO A-G, SPI×6, I2C×4, DMA×8
 *
 * Copyright (c) 2026 QEMU contributors
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qemu/units.h"
#include "qemu/log.h"
#include "qemu/datadir.h"
#include "qapi/error.h"
#include "qemu/error-report.h"
#include "hw/core/boards.h"
#include "hw/core/loader.h"
#include "hw/core/clock.h"
#include "hw/core/qdev-properties.h"
#include "hw/mips/mips.h"
#include "hw/mips/pic32mk.h"
#include "hw/mips/pic32mk_evic.h"
#include "hw/mips/pic32mk_usb.h"
#include "system/address-spaces.h"
#include "system/system.h"
#include "net/can_emu.h"
#include "chardev/char.h"
#include "cpu.h"

/* Device type strings from our peripheral files */
#define TYPE_PIC32MK_UART   "pic32mk-uart"
#define TYPE_PIC32MK_TIMER  "pic32mk-timer"
#define TYPE_PIC32MK_GPIO   "pic32mk-gpio"
#define TYPE_PIC32MK_SPI    "pic32mk-spi"
#define TYPE_PIC32MK_I2C    "pic32mk-i2c"
#define TYPE_PIC32MK_DMA    "pic32mk-dma"
#define TYPE_PIC32MK_CANFD  "pic32mk-canfd"
#define TYPE_PIC32MK_USB    "pic32mk-usb"
#define TYPE_PIC32MK_WDT    "pic32mk-wdt"
#define TYPE_PIC32MK_CRU    "pic32mk-cru"
#define TYPE_PIC32MK_CFG    "pic32mk-cfg"
#define TYPE_PIC32MK_ADCHS  "pic32mk-adchs"
#define TYPE_PIC32MK_NVM    "pic32mk-nvm"
#define TYPE_PIC32MK_DATAEE "pic32mk-dataee"
#define TYPE_PIC32MK_OC     "pic32mk-oc"
#define TYPE_PIC32MK_IC     "pic32mk-ic"

/*
 * Board state.
 */
typedef struct {
    MIPSCPU        *cpu;
    MemoryRegion    boot_rom;
    MemoryRegion    pflash;
    MemoryRegion    bflash1;
    MemoryRegion    bflash2;
    MemoryRegion    sfr;
    MemoryRegion    sfr_unimpl;
    MemoryRegion    pps_stub;   /* PPS input/output regs 0xBF801400-0xBF8017FF */

    DeviceState    *evic;
} PIC32MKState;

/*
 * SFR catch-all stub — logs every unimplemented register access.
 * -----------------------------------------------------------------------
 */

static uint64_t sfr_unimpl_read(void *opaque, hwaddr addr, unsigned size)
{
    qemu_log_mask(LOG_UNIMP,
                  "pic32mk: unimplemented SFR read  @ 0x%08" HWADDR_PRIx
                  " (size %u)\n",
                  (hwaddr)(PIC32MK_SFR_BASE + addr), size);
    return 0;
}

static void sfr_unimpl_write(void *opaque, hwaddr addr, uint64_t val,
                             unsigned size)
{
    qemu_log_mask(LOG_UNIMP,
                  "pic32mk: unimplemented SFR write @ 0x%08" HWADDR_PRIx
                  " = 0x%08" PRIx64 " (size %u)\n",
                  (hwaddr)(PIC32MK_SFR_BASE + addr), val, size);
}

static const MemoryRegionOps sfr_unimpl_ops = {
    .read       = sfr_unimpl_read,
    .write      = sfr_unimpl_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
    },
};

/*
 * Silent stub — used for PPS and other write-only config registers that
 * need no emulation but should not generate unimplemented warnings.
 */
static uint64_t sfr_ignore_read(void *opaque, hwaddr addr, unsigned size)
{
    return 0;
}
static void sfr_ignore_write(void *opaque, hwaddr addr, uint64_t val,
                             unsigned size)
{
    /* silently accept */
}
static const MemoryRegionOps sfr_ignore_ops = {
    .read       = sfr_ignore_read,
    .write      = sfr_ignore_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 4,
        .max_access_size = 4,
    },
};



/*
 * Helper: create a peripheral SysBusDevice, map its MMIO into the SFR
 * window at the given offset (overriding the catch-all at priority 1).
 * Returns the DeviceState for further property/IRQ wiring.
 * -----------------------------------------------------------------------
 */

static DeviceState *sfr_device_create(MemoryRegion *sfr, const char *type,
                                      hwaddr sfr_offset, Error **errp)
{
    DeviceState *dev = qdev_new(type);
    if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), errp)) {
        return NULL;
    }

    MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(dev), 0);
    memory_region_add_subregion_overlap(sfr, sfr_offset, mr, 1);
    return dev;
}

/*
 * Memory map initialisation
 * -----------------------------------------------------------------------
 */

static void pic32mk_memory_init(PIC32MKState *s, MachineState *machine)
{
    MemoryRegion *sys_mem = get_system_memory();

    /* 256 KB SRAM */
    memory_region_add_subregion(sys_mem, PIC32MK_RAM_BASE, machine->ram);

    /* 1 MB Program Flash — RAM-backed so NVM controller can write */
    memory_region_init_ram(&s->pflash, NULL, "pic32mk.pflash",
                           PIC32MK_PFLASH_SIZE, &error_fatal);
    memory_region_add_subregion(sys_mem, PIC32MK_PFLASH_BASE, &s->pflash);

    /* Boot Flash 1 — firmware loaded here via -bios */
    memory_region_init_rom(&s->bflash1, NULL, "pic32mk.bflash1",
                           PIC32MK_BFLASH1_SIZE, &error_fatal);
    memory_region_add_subregion(sys_mem, PIC32MK_BFLASH1_BASE, &s->bflash1);

    /* Boot Flash 2 */
    memory_region_init_rom(&s->bflash2, NULL, "pic32mk.bflash2",
                           PIC32MK_BFLASH2_SIZE, &error_fatal);
    memory_region_add_subregion(sys_mem, PIC32MK_BFLASH2_BASE, &s->bflash2);

    /*
     * Boot vector ROM — physical 0x1FC00000 to 0x1FC3FFFF.
     * Contains a two-instruction trampoline:
     *   j  0xBFC40000   (Boot Flash 1, KSEG1)
     *   nop             (branch delay slot)
     *
     * j-encoding when PC = 0xBFC00000:
     *   instr_index = (0xBFC40000 >> 2) & 0x3FFFFFF = 0x03F10000
     *   word = (2 << 26) | 0x03F10000 = 0x0BF10000
     */
    memory_region_init_rom(&s->boot_rom, NULL, "pic32mk.boot-rom",
                           PIC32MK_BOOTVEC_SIZE, &error_fatal);
    memory_region_add_subregion(sys_mem, PIC32MK_BOOTVEC_BASE, &s->boot_rom);
    {
        uint32_t *p = memory_region_get_ram_ptr(&s->boot_rom);
        p[0] = 0x0BF10000;  /* j 0xBFC40000 */
        p[1] = 0x00000000;  /* nop (delay slot) */
    }

    /* SFR window: 1 MB container */
    memory_region_init(&s->sfr, NULL, "pic32mk.sfr", PIC32MK_SFR_SIZE);
    memory_region_add_subregion(sys_mem, PIC32MK_SFR_BASE, &s->sfr);

    /* Catch-all at priority 0 */
    memory_region_init_io(&s->sfr_unimpl, NULL, &sfr_unimpl_ops, s,
                          "pic32mk.sfr-unimpl", PIC32MK_SFR_SIZE);
    memory_region_add_subregion_overlap(&s->sfr, 0, &s->sfr_unimpl, 0);

    /* PPS (Peripheral Pin Select) 0xBF801400–0xBF8017FF — silent stub */
    memory_region_init_io(&s->pps_stub, NULL, &sfr_ignore_ops, NULL,
                          "pic32mk.pps", PIC32MK_PPS_SIZE);
    memory_region_add_subregion_overlap(&s->sfr, PIC32MK_PPS_OFFSET,
                                        &s->pps_stub, 1);
}

