patchew-project/qemu/hw/mips/pic32mk.c
/*
 * CPU initialisation
 * -----------------------------------------------------------------------
 */

static void pic32mk_cpu_init(PIC32MKState *s, MachineState *machine)
{
    Clock *cpuclk;

    cpuclk = clock_new(OBJECT(machine), "cpu-refclk");
    clock_set_hz(cpuclk, PIC32MK_CPU_HZ);

    s->cpu = mips_cpu_create_with_clock(machine->cpu_type, cpuclk, false);
    if (!s->cpu) {
        error_report("pic32mk: failed to create CPU '%s'", machine->cpu_type);
        exit(1);
    }

    /*
     * Allocate the 8 CPU interrupt lines (env->irq[0..7]).
     * Must be called before wiring EVIC to CPU pins.
     */
    cpu_mips_irq_init_cpu(s->cpu);
    cpu_mips_clock_init(s->cpu);
}

/*
 * EVIC initialisation — create device, map MMIO, wire CPU pins
 * -----------------------------------------------------------------------
 */

static void pic32mk_evic_init(PIC32MKState *s)
{
    DeviceState *evic = qdev_new(TYPE_PIC32MK_EVIC);
    sysbus_realize_and_unref(SYS_BUS_DEVICE(evic), &error_fatal);

    MemoryRegion *evic_mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(evic), 0);
    memory_region_add_subregion_overlap(&s->sfr, PIC32MK_EVIC_OFFSET,
                                        evic_mr, 1);
    s->evic = evic;

    /*
     * Wire EVIC output pins to CPU interrupt inputs.
     * The EVIC device stores these handles and calls qemu_set_irq()
     * when a pending+enabled interrupt is found at a given priority level.
     */
    PIC32MKEVICState *evic_s = PIC32MK_EVIC(evic);
    CPUMIPSState *env = &s->cpu->env;
    for (int i = 0; i < 8; i++) {
        evic_s->cpu_irq[i] = env->irq[i];
    }

    /*
     * Intercept the CP0 Core Timer's interrupt output (normally fires on
     * env->irq[7]) and redirect it through EVIC source 0 (CT = Core Timer).
     *
     * This makes CP0 timer interrupts subject to IEC0[0] (CTIE) and
     * IPC0 priority configuration, as on real hardware.
     *
     * cp0_timer.c calls: qemu_irq_raise(env->irq[IPTI & 7])
     * With IPTI=7 (M14K default, CP0_IntCtl = 0xe0000000), that is irq[7].
     * We replace irq[7] with the EVIC's irq_in[PIC32MK_IRQ_CT].
     */
    env->irq[7] = qdev_get_gpio_in(evic, PIC32MK_IRQ_CT);

    /*
     * Intercept CP0 Software Interrupts 0 and 1 (env->irq[0..1]) and
     * redirect them through the EVIC (sources CS0=1, CS1=2).
     *
     * On real PIC32MK hardware, writing Cause.IP0 triggers EVIC source
     * "Core Software Interrupt 0" (CS0) at whatever priority is configured
     * in IPC0.  The EVIC then delivers the interrupt through the normal
     * priority comparison, which prevents same-priority nesting.
     *
     * In QEMU VEIC mode the pending-vs-status comparison is
     *   (Cause & 0xFF00) > (Status & 0xFF00)
     * If IP0 (bit 8) is left in Cause while the tick ISR sets IPL=1
     * (bit 10), 0x0500 > 0x0400 causes an unwanted nested interrupt.
     *
     * The custom handler below:
     *   1) routes SW0/SW1 through the EVIC input lines, and
     *   2) clears the direct Cause.IP0/IP1 bit so the VEIC comparison
     *      only sees the EVIC-asserted priority pin (bit 10+).
     */
    env->irq[0] = qdev_get_gpio_in(evic, PIC32MK_IRQ_CS0);
    env->irq[1] = qdev_get_gpio_in(evic, PIC32MK_IRQ_CS1);

    /*
     * Store a reference to the CPU env in the EVIC state so the
     * evic_set_irq handler can clear the direct Cause.IP bits for
     * software interrupt sources routed through the EVIC.
     */
    evic_s->cpu = s->cpu;
}

/*
 * Peripheral initialisation helpers
 * -----------------------------------------------------------------------
 */

/*
 * Create a UART instance, attach a chardev, map into the SFR window,
 * and connect its RX/TX/error IRQ outputs to the EVIC input lines.
 */
static void pic32mk_uart_create(PIC32MKState *s, int index,
                                hwaddr sfr_offset,
                                int irq_rx, int irq_tx, int irq_err,
                                Chardev *chr)
{
    DeviceState *dev = qdev_new(TYPE_PIC32MK_UART);
    if (chr) {
        qdev_prop_set_chr(dev, "chardev", chr);
    }
    sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_fatal);

    MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(dev), 0);
    memory_region_add_subregion_overlap(&s->sfr, sfr_offset, mr, 1);

    /* Connect UART IRQ outputs → EVIC inputs */
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0,
                       qdev_get_gpio_in(s->evic, irq_rx));
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 1,
                       qdev_get_gpio_in(s->evic, irq_tx));
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 2,
                       qdev_get_gpio_in(s->evic, irq_err));
}

/*
 * Create a Timer instance, map into the SFR window, connect IRQ to EVIC.
 */
static void pic32mk_timer_create(PIC32MKState *s,
                                 hwaddr sfr_offset, int irq_src, bool type_a)
{
    DeviceState *dev = qdev_new(TYPE_PIC32MK_TIMER);
    qdev_prop_set_bit(dev, "type-a", type_a);
    sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_fatal);
    memory_region_add_subregion_overlap(&s->sfr, sfr_offset,
        sysbus_mmio_get_region(SYS_BUS_DEVICE(dev), 0), 1);
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0,
                       qdev_get_gpio_in(s->evic, irq_src));
}

static void pic32mk_oc_create(PIC32MKState *s, int index,
                              hwaddr sfr_offset, int irq_src)
{
    DeviceState *dev = qdev_new(TYPE_PIC32MK_OC);
    qdev_prop_set_uint8(dev, "index", (uint8_t)index);
    sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_fatal);
    memory_region_add_subregion_overlap(&s->sfr, sfr_offset,
        sysbus_mmio_get_region(SYS_BUS_DEVICE(dev), 0), 1);
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0,
                       qdev_get_gpio_in(s->evic, irq_src));
    /* Optional chardev for waveform event streaming */
    Chardev *chr = qemu_chr_find("oc-events");
    if (chr) {
        pic32mk_oc_set_chardev(dev, chr);
    }
}

/*
 * pic32mk_ic_create — instantiate one IC peripheral and map it into the SFR
 * window.  irq_cap = capture IRQ index, irq_err = error IRQ index (Table 8-3).
 * The optional chardev "ic-events" is used to inject capture events from the
 * host; must be set before sysbus_realize_and_unref.
 */
static void pic32mk_ic_create(PIC32MKState *s, int index,
                              hwaddr sfr_offset, int irq_cap, int irq_err)
{
    DeviceState *dev = qdev_new(TYPE_PIC32MK_IC);
    qdev_prop_set_uint8(dev, "index", (uint8_t)index);
    /*
     * Only IC1 owns the "ic-events" chardev; it dispatches to all instances
     * via a global routing table registered during realize.
      */
    if (index == 1) {
        Chardev *chr = qemu_chr_find("ic-events");
        if (chr) {
            qdev_prop_set_chr(dev, "chardev", chr);
        }
    }
    sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_fatal);
    memory_region_add_subregion_overlap(&s->sfr, sfr_offset,
        sysbus_mmio_get_region(SYS_BUS_DEVICE(dev), 0), 1);
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0,
                       qdev_get_gpio_in(s->evic, irq_cap));
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 1,
                       qdev_get_gpio_in(s->evic, irq_err));
}

static const char * const pic32mk_gpio_port_names[PIC32MK_GPIO_NPORTS] = {
    "gpio-portA", "gpio-portB", "gpio-portC", "gpio-portD",
    "gpio-portE", "gpio-portF", "gpio-portG",
};

