patchew-project/qemu/hw/mips/pic32mk.c
/*
 * Create a GPIO port instance, map into the SFR window.
 * The CN interrupt output (sysbus IRQ 0) is wired to the EVIC.
 * The device is registered as a named child of the machine object so that
 * QOM paths are predictable: /machine/gpio-portA … /machine/gpio-portG.
 */
static void pic32mk_gpio_create(PIC32MKState *s, MachineState *machine,
                                int port_idx, hwaddr sfr_offset, int cn_irq,
                                Chardev *gpio_chr)
{
    /*
     * Create the device first, register it as a named child of the machine
     * BEFORE calling sysbus_realize_and_unref().  If the object already has
     * a parent when device_realize() runs it will NOT be placed under the
     * anonymous machine/unattached container, so object_property_add_child()
     * won't hit the "!child->parent" assertion.
     */
    DeviceState *dev = qdev_new(TYPE_PIC32MK_GPIO);
    qdev_prop_set_uint8(dev, "port-index", (uint8_t)port_idx);
    object_property_add_child(OBJECT(machine),
                              pic32mk_gpio_port_names[port_idx], OBJECT(dev));
    if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_fatal)) {
        return;
    }

    /* Shared chardev for GPIO event streaming (all ports write to same chardev) */
    if (gpio_chr) {
        pic32mk_gpio_set_chardev(dev, gpio_chr);
    }

    MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(dev), 0);
    memory_region_add_subregion_overlap(&s->sfr, sfr_offset, mr, 1);

    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0,
                       qdev_get_gpio_in(s->evic, cn_irq));
}

/*
 * Create a SPI instance, map into the SFR window.
 */
static void pic32mk_spi_create(PIC32MKState *s, int index, hwaddr sfr_offset,
                               int irq_rx, int irq_tx, int irq_err)
{
    DeviceState *dev = qdev_new(TYPE_PIC32MK_SPI);
    char chr_name[16];

    qdev_prop_set_uint8(dev, "spi-index", (uint8_t)index);
    snprintf(chr_name, sizeof(chr_name), "spi%d", index);
    Chardev *chr = qemu_chr_find(chr_name);
    if (chr) {
        qdev_prop_set_chr(dev, "chardev", chr);
    }

    sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_fatal);

    MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(dev), 0);
    memory_region_add_subregion_overlap(&s->sfr, sfr_offset, mr, 1);

    if (irq_rx >= 0) {
        sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0,
                           qdev_get_gpio_in(s->evic, irq_rx));
    }
    if (irq_tx >= 0) {
        sysbus_connect_irq(SYS_BUS_DEVICE(dev), 1,
                           qdev_get_gpio_in(s->evic, irq_tx));
    }
    if (irq_err >= 0) {
        sysbus_connect_irq(SYS_BUS_DEVICE(dev), 2,
                           qdev_get_gpio_in(s->evic, irq_err));
    }
}

/*
 * Create an I2C instance, map into the SFR window.
 */
static void pic32mk_i2c_create(PIC32MKState *s, hwaddr sfr_offset)
{
    sfr_device_create(&s->sfr, TYPE_PIC32MK_I2C, sfr_offset, &error_fatal);
}

/*
 * pic32mk_find_canbus — look up a can-bus object created with
 *   -object can-bus,id=canbus<idx>
 * Returns NULL if no such object exists (CAN instance runs standalone).
 */
static CanBusState *pic32mk_find_canbus(int idx)
{
    char path[32];
    snprintf(path, sizeof(path), "/objects/canbus%d", idx);
    Object *obj = object_resolve_path_type(path, TYPE_CAN_BUS, NULL);
    return obj ? CAN_BUS(obj) : NULL;
}

/*
 * Create a CAN FD instance:
 *  - SFR region (mmio 0) mapped into the SFR window at sfr_offset
 *  - Message RAM (mmio 1) mapped into system memory at msgram_phys_base
 *  - Single IRQ wired to EVIC input irq_src
 *  - canbus: optional virtual bus (NULL = standalone/loopback only)
 */
static void pic32mk_canfd_create(PIC32MKState *s,
                                 hwaddr sfr_offset,
                                 hwaddr msgram_phys_base,
                                 int irq_src,
                                 CanBusState *canbus,
                                 uint32_t instance_id)
{
    DeviceState *dev = qdev_new(TYPE_PIC32MK_CANFD);
    qdev_prop_set_uint32(dev, "msg-ram-base", (uint32_t)msgram_phys_base);
    qdev_prop_set_uint32(dev, "instance-id", instance_id);
    if (canbus) {
        object_property_set_link(OBJECT(dev), "canbus",
                                 OBJECT(canbus), &error_fatal);
    }
    sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_fatal);

    /* SFR block overrides the catch-all at priority 1 */
    memory_region_add_subregion_overlap(&s->sfr, sfr_offset,
        sysbus_mmio_get_region(SYS_BUS_DEVICE(dev), 0), 1);

    /* Message RAM mapped into the flat system address space */
    memory_region_add_subregion(get_system_memory(), msgram_phys_base,
        sysbus_mmio_get_region(SYS_BUS_DEVICE(dev), 1));

    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0,
                       qdev_get_gpio_in(s->evic, irq_src));
}

/*
 * Create a USB OTG instance, map SFR into the SFR window, connect IRQ.
 */
static void pic32mk_usb_create(PIC32MKState *s,
                               hwaddr sfr_offset, int irq_src,
                               const char *chardev_id)
{
    DeviceState *dev = qdev_new(TYPE_PIC32MK_USB);
    if (chardev_id) {
        Chardev *chr = qemu_chr_find(chardev_id);
        if (chr) {
            qdev_prop_set_chr(dev, "chardev", chr);
        }
    }
    sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_fatal);
    memory_region_add_subregion_overlap(&s->sfr, sfr_offset,
        sysbus_mmio_get_region(SYS_BUS_DEVICE(dev), 0), 1);
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0,
                       qdev_get_gpio_in(s->evic, irq_src));
}

/*
 * Firmware loading
 * -----------------------------------------------------------------------
 */

static void pic32mk_load_firmware(MachineState *machine)
{
    if (!machine->firmware) {
        return;
    }

    char *filename = qemu_find_file(QEMU_FILE_TYPE_BIOS, machine->firmware);
    if (!filename) {
        error_report("pic32mk: could not find firmware '%s'",
                     machine->firmware);
        exit(1);
    }

    ssize_t bios_size = load_image_targphys(filename,
                                            PIC32MK_BFLASH1_BASE,
                                            PIC32MK_BFLASH1_SIZE,
                                            NULL);
    g_free(filename);

    if (bios_size < 0) {
        error_report("pic32mk: could not load firmware '%s'",
                     machine->firmware);
        exit(1);
    }
}

