patchew-project/qemu/hw/mips/pic32mk.c
/*
 * Machine entry point
 * -----------------------------------------------------------------------
 */

static void pic32mk_machine_init(MachineState *machine)
{
    PIC32MKState *s = g_new0(PIC32MKState, 1);

    pic32mk_cpu_init(s, machine);
    pic32mk_memory_init(s, machine);

    /* EVIC — must come before peripherals so we can wire IRQs */
    pic32mk_evic_init(s);

    /* DMA — mapped into the EVIC's 4 KB page (DMA_OFFSET = EVIC+0x1000) */
    {
        DeviceState *dma = qdev_new(TYPE_PIC32MK_DMA);
        sysbus_realize_and_unref(SYS_BUS_DEVICE(dma), &error_fatal);
        MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(dma), 0);
        memory_region_add_subregion_overlap(&s->sfr, PIC32MK_DMA_OFFSET, mr, 1);
        for (int i = 0; i < PIC32MK_DMA_NCHANNELS; i++) {
            sysbus_connect_irq(SYS_BUS_DEVICE(dma), i,
                               qdev_get_gpio_in(s->evic,
                                                PIC32MK_IRQ_DMA0 + i));
        }
    }

    /* UART1 on serial_hd(0), UART2–6 without chardev (stub only) */
    pic32mk_uart_create(s, 1, PIC32MK_UART1_OFFSET,
                        PIC32MK_IRQ_U1RX, PIC32MK_IRQ_U1TX, PIC32MK_IRQ_U1E,
                        serial_hd(0));
    pic32mk_uart_create(s, 2, PIC32MK_UART2_OFFSET,
                        PIC32MK_IRQ_U2RX, PIC32MK_IRQ_U2TX, PIC32MK_IRQ_U2E,
                        serial_hd(1));
    pic32mk_uart_create(s, 3, PIC32MK_UART3_OFFSET,
                        PIC32MK_IRQ_U3RX, PIC32MK_IRQ_U3TX, PIC32MK_IRQ_U3E,
                        serial_hd(2));
    pic32mk_uart_create(s, 4, PIC32MK_UART4_OFFSET,
                        PIC32MK_IRQ_U4RX, PIC32MK_IRQ_U4TX, PIC32MK_IRQ_U4E,
                        serial_hd(3));
    pic32mk_uart_create(s, 5, PIC32MK_UART5_OFFSET,
                        PIC32MK_IRQ_U5RX, PIC32MK_IRQ_U5TX, PIC32MK_IRQ_U5E,
                        serial_hd(4));
    pic32mk_uart_create(s, 6, PIC32MK_UART6_OFFSET,
                        PIC32MK_IRQ_U6RX, PIC32MK_IRQ_U6TX, PIC32MK_IRQ_U6E,
                        serial_hd(5));

    /* Timers 1–9: Timer1 is Type A (2-bit TCKPS {1,8,64,256}); 2–9 are Type B/C */
    pic32mk_timer_create(s, PIC32MK_T1_OFFSET, PIC32MK_IRQ_T1, true);
    pic32mk_timer_create(s, PIC32MK_T2_OFFSET, PIC32MK_IRQ_T2, false);
    pic32mk_timer_create(s, PIC32MK_T3_OFFSET, PIC32MK_IRQ_T3, false);
    pic32mk_timer_create(s, PIC32MK_T4_OFFSET, PIC32MK_IRQ_T4, false);
    pic32mk_timer_create(s, PIC32MK_T5_OFFSET, PIC32MK_IRQ_T5, false);
    pic32mk_timer_create(s, PIC32MK_T6_OFFSET, PIC32MK_IRQ_T6, false);
    pic32mk_timer_create(s, PIC32MK_T7_OFFSET, PIC32MK_IRQ_T7, false);
    pic32mk_timer_create(s, PIC32MK_T8_OFFSET, PIC32MK_IRQ_T8, false);
    pic32mk_timer_create(s, PIC32MK_T9_OFFSET, PIC32MK_IRQ_T9, false);

    /* Output Compare OC1–OC16 (diagnostic emulation) */
    pic32mk_oc_create(s, 1,  PIC32MK_OC1_OFFSET,  PIC32MK_IRQ_OC1);
    pic32mk_oc_create(s, 2,  PIC32MK_OC2_OFFSET,  PIC32MK_IRQ_OC2);
    pic32mk_oc_create(s, 3,  PIC32MK_OC3_OFFSET,  PIC32MK_IRQ_OC3);
    pic32mk_oc_create(s, 4,  PIC32MK_OC4_OFFSET,  PIC32MK_IRQ_OC4);
    pic32mk_oc_create(s, 5,  PIC32MK_OC5_OFFSET,  PIC32MK_IRQ_OC5);
    pic32mk_oc_create(s, 6,  PIC32MK_OC6_OFFSET,  PIC32MK_IRQ_OC6);
    pic32mk_oc_create(s, 7,  PIC32MK_OC7_OFFSET,  PIC32MK_IRQ_OC7);
    pic32mk_oc_create(s, 8,  PIC32MK_OC8_OFFSET,  PIC32MK_IRQ_OC8);
    pic32mk_oc_create(s, 9,  PIC32MK_OC9_OFFSET,  PIC32MK_IRQ_OC9);
    pic32mk_oc_create(s, 10, PIC32MK_OC10_OFFSET, PIC32MK_IRQ_OC10);
    pic32mk_oc_create(s, 11, PIC32MK_OC11_OFFSET, PIC32MK_IRQ_OC11);
    pic32mk_oc_create(s, 12, PIC32MK_OC12_OFFSET, PIC32MK_IRQ_OC12);
    pic32mk_oc_create(s, 13, PIC32MK_OC13_OFFSET, PIC32MK_IRQ_OC13);
    pic32mk_oc_create(s, 14, PIC32MK_OC14_OFFSET, PIC32MK_IRQ_OC14);
    pic32mk_oc_create(s, 15, PIC32MK_OC15_OFFSET, PIC32MK_IRQ_OC15);
    pic32mk_oc_create(s, 16, PIC32MK_OC16_OFFSET, PIC32MK_IRQ_OC16);

    /* Input Capture IC1–IC16 (full register model with FIFO) */
    pic32mk_ic_create(s, 1,  PIC32MK_IC1_OFFSET,  PIC32MK_IRQ_IC1,  PIC32MK_IRQ_IC1E);
    pic32mk_ic_create(s, 2,  PIC32MK_IC2_OFFSET,  PIC32MK_IRQ_IC2,  PIC32MK_IRQ_IC2E);
    pic32mk_ic_create(s, 3,  PIC32MK_IC3_OFFSET,  PIC32MK_IRQ_IC3,  PIC32MK_IRQ_IC3E);
    pic32mk_ic_create(s, 4,  PIC32MK_IC4_OFFSET,  PIC32MK_IRQ_IC4,  PIC32MK_IRQ_IC4E);
    pic32mk_ic_create(s, 5,  PIC32MK_IC5_OFFSET,  PIC32MK_IRQ_IC5,  PIC32MK_IRQ_IC5E);
    pic32mk_ic_create(s, 6,  PIC32MK_IC6_OFFSET,  PIC32MK_IRQ_IC6,  PIC32MK_IRQ_IC6E);
    pic32mk_ic_create(s, 7,  PIC32MK_IC7_OFFSET,  PIC32MK_IRQ_IC7,  PIC32MK_IRQ_IC7E);
    pic32mk_ic_create(s, 8,  PIC32MK_IC8_OFFSET,  PIC32MK_IRQ_IC8,  PIC32MK_IRQ_IC8E);
    pic32mk_ic_create(s, 9,  PIC32MK_IC9_OFFSET,  PIC32MK_IRQ_IC9,  PIC32MK_IRQ_IC9E);
    pic32mk_ic_create(s, 10, PIC32MK_IC10_OFFSET, PIC32MK_IRQ_IC10, PIC32MK_IRQ_IC10E);
    pic32mk_ic_create(s, 11, PIC32MK_IC11_OFFSET, PIC32MK_IRQ_IC11, PIC32MK_IRQ_IC11E);
    pic32mk_ic_create(s, 12, PIC32MK_IC12_OFFSET, PIC32MK_IRQ_IC12, PIC32MK_IRQ_IC12E);
    pic32mk_ic_create(s, 13, PIC32MK_IC13_OFFSET, PIC32MK_IRQ_IC13, PIC32MK_IRQ_IC13E);
    pic32mk_ic_create(s, 14, PIC32MK_IC14_OFFSET, PIC32MK_IRQ_IC14, PIC32MK_IRQ_IC14E);
    pic32mk_ic_create(s, 15, PIC32MK_IC15_OFFSET, PIC32MK_IRQ_IC15, PIC32MK_IRQ_IC15E);
    pic32mk_ic_create(s, 16, PIC32MK_IC16_OFFSET, PIC32MK_IRQ_IC16, PIC32MK_IRQ_IC16E);

    /* GPIO ports A–G: CN interrupt vectors 44–50 (_CHANGE_NOTICE_x_VECTOR) */
    static const int cn_irqs[PIC32MK_GPIO_NPORTS] = {
        PIC32MK_IRQ_CNA, PIC32MK_IRQ_CNB, PIC32MK_IRQ_CNC, PIC32MK_IRQ_CND,
        PIC32MK_IRQ_CNE, PIC32MK_IRQ_CNF, PIC32MK_IRQ_CNG,
    };
    /* Optional: look up shared chardev "gpio-events" for GUI event streaming */
    Chardev *gpio_chr = qemu_chr_find("gpio-events");
    for (int port = 0; port < PIC32MK_GPIO_NPORTS; port++) {
        pic32mk_gpio_create(s, machine, port,
                            PIC32MK_GPIO_OFFSET
                            + (hwaddr)port * PIC32MK_GPIO_PORT_SIZE,
                            cn_irqs[port], gpio_chr);
    }

    /* SPI 1–6 */
    pic32mk_spi_create(s, 1, PIC32MK_SPI1_OFFSET,
                       PIC32MK_IRQ_SPI1_RX,
                       PIC32MK_IRQ_SPI1_TX,
                       PIC32MK_IRQ_SPI1_FAULT);
    pic32mk_spi_create(s, 2, PIC32MK_SPI2_OFFSET,
                       PIC32MK_IRQ_SPI2_RX,
                       PIC32MK_IRQ_SPI2_TX,
                       PIC32MK_IRQ_SPI2_FAULT);
    pic32mk_spi_create(s, 3, PIC32MK_SPI3_OFFSET,
                       PIC32MK_IRQ_SPI3_RX,
                       PIC32MK_IRQ_SPI3_TX,
                       PIC32MK_IRQ_SPI3_FAULT);
    pic32mk_spi_create(s, 4, PIC32MK_SPI4_OFFSET,
                       PIC32MK_IRQ_SPI4_RX,
                       PIC32MK_IRQ_SPI4_TX,
                       PIC32MK_IRQ_SPI4_FAULT);
    pic32mk_spi_create(s, 5, PIC32MK_SPI5_OFFSET,
                       PIC32MK_IRQ_SPI5_RX,
                       PIC32MK_IRQ_SPI5_TX,
                       PIC32MK_IRQ_SPI5_FAULT);
    pic32mk_spi_create(s, 6, PIC32MK_SPI6_OFFSET,
                       PIC32MK_IRQ_SPI6_RX,
                       PIC32MK_IRQ_SPI6_TX,
                       PIC32MK_IRQ_SPI6_FAULT);

