patchew-project/qemu/hw/mips/pic32mk.c
    /* I2C 1–4 */
    pic32mk_i2c_create(s, PIC32MK_I2C1_OFFSET);
    pic32mk_i2c_create(s, PIC32MK_I2C2_OFFSET);
    pic32mk_i2c_create(s, PIC32MK_I2C3_OFFSET);
    pic32mk_i2c_create(s, PIC32MK_I2C4_OFFSET);

    /* ADCHS — High-Speed ADC at 0xBF887000 */
    {
        DeviceState *adc = qdev_new(TYPE_PIC32MK_ADCHS);
        object_property_add_child(OBJECT(machine), "adchs", OBJECT(adc));
        sysbus_realize_and_unref(SYS_BUS_DEVICE(adc), &error_fatal);
        MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(adc), 0);
        memory_region_add_subregion_overlap(&s->sfr, PIC32MK_ADC_OFFSET,
                                            mr, 1);
        /* IRQ 0 = EOS (101), IRQ 1 = main ADC (92) */
        sysbus_connect_irq(SYS_BUS_DEVICE(adc), 0,
                           qdev_get_gpio_in(s->evic, PIC32MK_IRQ_ADC_EOS));
        sysbus_connect_irq(SYS_BUS_DEVICE(adc), 1,
                           qdev_get_gpio_in(s->evic, PIC32MK_IRQ_ADC));
    }

    /* CAN FD 1–4 */
    pic32mk_canfd_create(s, PIC32MK_CAN1_OFFSET,
                         PIC32MK_CAN1_MSGRAM_BASE, PIC32MK_IRQ_CAN1,
                         pic32mk_find_canbus(0), 0);
    pic32mk_canfd_create(s, PIC32MK_CAN2_OFFSET,
                         PIC32MK_CAN2_MSGRAM_BASE, PIC32MK_IRQ_CAN2,
                         pic32mk_find_canbus(1), 1);
    pic32mk_canfd_create(s, PIC32MK_CAN3_OFFSET,
                         PIC32MK_CAN3_MSGRAM_BASE, PIC32MK_IRQ_CAN3,
                         pic32mk_find_canbus(2), 2);
    pic32mk_canfd_create(s, PIC32MK_CAN4_OFFSET,
                         PIC32MK_CAN4_MSGRAM_BASE, PIC32MK_IRQ_CAN4,
                         pic32mk_find_canbus(3), 3);

    /* USB OTG 1–2 (Phase 4A — register-file stub) */
    pic32mk_usb_create(s, PIC32MK_USB1_OFFSET, PIC32MK_IRQ_USB1, "usbcdc");
    pic32mk_usb_create(s, PIC32MK_USB2_OFFSET, PIC32MK_IRQ_USB2, NULL);

    /* WDT — register-file stub; absorbs WDTCON reads/writes and clear-key */
    sfr_device_create(&s->sfr, TYPE_PIC32MK_WDT, PIC32MK_WDT_OFFSET,
                      &error_fatal);

    /* CFG / PMD / SYSKEY — register block at 0xBF800000 */
    sfr_device_create(&s->sfr, TYPE_PIC32MK_CFG, PIC32MK_CFG_OFFSET,
                      &error_fatal);

    /* CRU — Clock Reference Unit at 0xBF801200 (includes RCON/RSWRST) */
    sfr_device_create(&s->sfr, TYPE_PIC32MK_CRU, PIC32MK_CRU_OFFSET,
                      &error_fatal);

    /* NVM / Flash Controller at 0xBF800A00 */
    {
        DeviceState *nvm = qdev_new(TYPE_PIC32MK_NVM);
        object_property_set_link(OBJECT(nvm), "pflash",
                                 OBJECT(&s->pflash), &error_fatal);
        sysbus_realize_and_unref(SYS_BUS_DEVICE(nvm), &error_fatal);
        MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(nvm), 0);
        memory_region_add_subregion_overlap(&s->sfr, PIC32MK_NVM_OFFSET,
                                            mr, 1);
        sysbus_connect_irq(SYS_BUS_DEVICE(nvm), 0,
                           qdev_get_gpio_in(s->evic, PIC32MK_IRQ_FCE));
    }

    /* Data EEPROM at 0xBF829000 — 4 KB, optionally backed by host file */
    {
        DeviceState *ee = qdev_new(TYPE_PIC32MK_DATAEE);
        /* Backing file: use -global pic32mk-dataee.filename=<path> */
        sysbus_realize_and_unref(SYS_BUS_DEVICE(ee), &error_fatal);
        MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(ee), 0);
        memory_region_add_subregion_overlap(&s->sfr, PIC32MK_DATAEE_OFFSET,
                                            mr, 1);
        sysbus_connect_irq(SYS_BUS_DEVICE(ee), 0,
                           qdev_get_gpio_in(s->evic, PIC32MK_IRQ_DATAEE));
    }

    pic32mk_load_firmware(machine);
}

/*
 * MachineClass registration
 * -----------------------------------------------------------------------
 */

static void pic32mk_machine_class_init(MachineClass *mc)
{
    mc->desc           = "Microchip PIC32MK GPK/MCM with CAN FD";
    mc->init           = pic32mk_machine_init;
    mc->max_cpus       = 1;
    /*
     * microAptiv: MIPS32r2 + FPU + DSP R2 + microMIPS + MCU ASE,
     * fixed-mapping MMU, VEIC — matches PIC32MK DS60001519E §3.
     */
    mc->default_cpu_type = MIPS_CPU_TYPE_NAME("microAptiv");
    mc->default_ram_id   = "pic32mk.ram";
    mc->default_ram_size = PIC32MK_RAM_SIZE;
    mc->no_parallel      = 1;
    mc->no_floppy        = 1;
    mc->no_cdrom         = 1;
}

DEFINE_MACHINE("pic32mk", pic32mk_machine_class_init)
